app/views/main/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 94], ["LIMIT", 1]]
---
<% user = User.find_by(id: session[:user_id]) %>