app/controllers/sessions_controller.rb

  def create
    u = User.find_by(email: params["email"])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "cookies@example.com"], ["LIMIT", 1]]