app/controllers/tasks_controller.rb

  def show
    @date = params["date"]
    @tasks = Task.where(date: @date,user_id:@user.id).all
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."date" = ? AND "tasks"."user_id" = ?  [["date", "2017-07-30"], ["user_id", 67]]

  def edit
    @task = Task.find_by(id: params["id"])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]

  def update
    t = Task.find_by(id: params["id"])
    t.name = params["name"]
    t.description = params["description"]
    t.date = params["date"]
    t.hour = params["time"]["written_on(4i)"]
    t.minute = params["time"]["written_on(5i)"]
    t.importance = params["importance"]
    if t.save
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
UPDATE "tasks" SET "hour" = ?, "minute" = ?, "importance" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["hour", "01"], ["minute", "03"], ["importance", nil], ["updated_at", "2017-08-03 20:54:36.533983"], ["id", 50]]

  def create
    t = Task.new
    t.name = params["name"]
    t.description = params["description"]
    t.date = params["date"]
    t.user_id=@user.id
    t.hour = params["time"]["written_on(4i)"]
    t.minute = params["time"]["written_on(5i)"]
    t.importance = params["importance"]
    if t.save
---
INSERT INTO "tasks" ("description", "created_at", "updated_at", "name", "date", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["description", "hi"], ["created_at", "2017-07-31 06:43:50.267675"], ["updated_at", "2017-07-31 06:43:50.267675"], ["name", "hi"], ["date", "2017-07-30"], ["user_id", 67]]

    task = Task.find_by(id: params["id"])
    date = task.date
    task.destroy
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 22]]