app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    user = User.new
    user.name = params['name']
    user.email = params['email']
    user.password = params['password']
    if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]
---
  def show
    @user = User.find_by(id: params["id"])