app/views/layouts/_navbar.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
---
        <% if session["user_id"].present? %>
          <% user = User.find_by(id: session["user_id"]) %>